// Реалізувати рекурсивну функцію, яка зводить число в ступінь.
//
// Число, яке потрібно звести в ступінь, передається як перший аргумент у функцію
//
// Ступінь передається як другий аргумент у функцію
//
// pow(num, degree)

function pow(num, degree) {
  if (degree === 1) {
    return num;
  } else if (degree === 0) {   // якщо зводимо до нульової степені
    return 1;
  } else if (degree < 0) {
    return  1 / num * pow(num, degree + 1)
  } else {
  return num * pow(num, degree - 1);
  }
}



console.log("2 ** 1 = ", pow(2, 1));             //  2 в 1 степені    === 2
console.log("2 ** 2 = ", pow(2, 2));             //  2 * 2            === 4
console.log("2 ** 3 = ", pow(2, 3));             //  2 * 2 * 2        === 8
console.log("2 ** 4 = ", pow(2, 4));             //  2 * 2 * 2 * 2    === 16
console.log("2 ** 0 = ", pow(2, 0));             //  2 в 0 степені    === 1
console.log("2 ** -2 = 1/4 або ", pow(2, -2));   // 2 в -2 степені   === 1/4  або 0,25
console.log("2 ** -1 = 1/2 або ", pow(2, -1));   // 2 в -1 степені   === 1/2  або 0,5
